export const serverError='خطای سرور';
export const inValidResponseFormatGridRows=`${serverError}: فرمت سطرها صحیح نیست`;

export const sejamUnknownError='خطا در دریافت اطلاعات! ';
export const FileUploadDragDropTitle='فایل موردنظر خود را در این قسمت رها کرده و یا از طریق دکمه انتخاب فایل، فایل خود را انتخاب نمایید'
export const FileUploadInputTitle='انتخاب فایل';

export const sejamErrors={
    '4001':`شماره موبایل اشتباه است`,
    '4002':'زمان اعتبار کد تأیید به پایان رسیده است',
    '4004':'ثبت نام تکمیل نشده است',
    '4005':'کدپیگیری اشتباه است',
    '4008':'حجم تصویر زیاد است',
    '4010':'کاربر اعتبارسنجی نشد',
    '4011':'دسترسی کاربر قفل شده است',
    '4031':'کد تأیید نامعتبر است',
    '4041':'کاربر مورد نظر یافت نشد',
    '4290':'تعداد درخواست سرویس بیش از حد مجاز',
    '600':'عدم ارسال اس ام اس'
}
