import { Typography } from '@mui/material';
import Box from '@mui/material/Box'
import Grid from '@mui/system/Unstable_Grid';
import React, { useContext } from 'react';
import hadafLogo from '../../assets/hadaflogo.png';
import { compareAsc, format, newDate } from 'date-fns-jalali'
import { padding } from '@mui/system';
import { AuthContext } from '../../contexts/AuthContext';

const definitions = [
  {
    title: ' سبدگردان ',
    description: 'منظور از سبدگردان طرف این قرارداد است که مشخصات آن در ماده یک آمده است.'
  },
  {
    title: ' سرمایه گذار',
    description: 'منظور از سرمایه گذار طرف این قرارداد است که مشخصات آن در ماده یک آمده است'
  },
  {
    title: ' سبد اختصاصی',
    description: 'منظور مجموع دارایی های متعلق به سرمایه گذار است ، که براساس این قرارداد یا متمم های آن به منظور سبدگردانی در اختیار سبدگردان قرار داده شده یا می شود.'
  },
  {
    title: 'سبدگردانی',
    description: 'تصمیم به خرید ،‌فروش یا نگه داری اوراق بهادار یا افتتاح س‍‍پرده های بانکی یا انجام هر گونه سرمایه گذاری توسط سبدگردان به نام سرمایه گذار از محل سبد اختصاصی وی به منظور کسب انتفاع برای سرمایه گذار.'
  },
  {
    title: ' قیمت پایانی',
    description: 'قیمت پایانی هر ورقه ی بهادار در هر روز ،‌برابر قیمتی است که طبق مقررات در بازار به عنوان قیمت پایانی آن ورقه بهادار اعلام یا تعیین می شود.'
  },
  {
    title: 'قرارداد',
    description: ' منظور قرارداد حاضر است.در صورتی که منظور قرارداد دیگری باشد ،‌قرارداد مورد نظر تصریح می گردد.'
  },
  {
    title: 'دستورالعمل تأسیس و فعالیت سبدگردان',
    description: 'منظور دستورالعمل تأسیس و فعالیت سبدگردان مصوب هیئت مدیره ی سازمان است.'
  },
  {
    title: 'سازمان',
    description: 'منظور سازمان بورس و اوراق بهادار موضوع ماده ۵ قانون بازار اوراق بهادار مصوب آذر ماه ۱۳۸۴ مجلس شورای اسلامی است.'
  },
  {
    title: 'امین',
    description: 'شخص حقوقی که مطابق دستورالعمل تأسیس وفعالیت سبدگردان انتخاب شده وضمن انعقاد قرارداد با سبدگردان،‌وظایف پیش بینی شده در دستورالعمل یادشده را درقبال سبدگردان به عهده گرفته است.'
  },
  {
    title: 'روزکاری',
    description: ' منظور روزهای شنبه تا چهارشنبه هر هفته به استثنای روزهایی که طبق مقررات ایران تعطیل رسمی می باشد.از ساعت ۸ لغایت ۱۶ به وقت محلی تهران است.'
  }
]

const today = format(new Date(), 'yyyy/MM/dd');
const SejamAccountContractStep = () => {
  const { user } = useContext(AuthContext) as any;;
  const flexRowStyle = { display: 'flex', flexDirection: 'row' };
  const flexColumnStyle = { display: 'flex', flexDirection: 'column' };
  const test = '.....';
  const namayandegi = 'آقایان عباسعلی حقانی نسب و سعید حقانی نسب که بر اساس روزنامه رسمی شماره:  ۲۱۵۹۶  به تاریخ:  ۱۷/۲/۱۳۹۸ صاحبان امضا مجاز شناخته می شوند.';
  const accountType = 'سبد اختصاصی';
  const totalPrice = "....";
  const sabadGardanAddress = 'تهران- خیابان شهید بهشتی- پلاک  436- ساختمان پارسه- طبقه چهارم- واحد15 به نمایندگی: آقایان عباسعلی حقانی نسب و سعید حقانی نسب که بر اساس روزنامه رسمی'
  return (
    <Box sx={{ '& .MuiTypography-root': { lineHeight: 3 }, padding: '1rem' }}>
      <Box sx={{ ...flexRowStyle, justifyContent: 'space-between', alignItems: 'center' }}>
        <img src={hadafLogo} />
        <Box sx={flexColumnStyle}>
          <Section title={'تاریخ'} value={today} />
          <Section title={'شماره قرارداد '} value={test} />
        </Box>
      </Box>
      <Box sx={{ ...flexColumnStyle, alignItems: 'center' }}>
        <Typography component={'div'} variant='h5'>حساب سبد سرمایه گذاری اختصاصی</Typography>
        <Typography component={'div'} variant='h6'>قرارداد سبدگردانی اختصاصی اوراق بهادار</Typography>
      </Box>
      <Typography>
        ماده ۱: طرفین قرارداد :
      </Typography>
      <Typography>
        <Typography>
          این قرارداد بین مشتری با مشخصات :
        </Typography>
        <Box sx={{ ...flexRowStyle, gap: '1rem' }}>
          <Section title='نام' value={user.firstName} />
          <Section title='نام خانوادگی' value={user.lastName} />
          <Section title=' شماره شناسنامه' value={test} />
          <Section title='شماره ملی' value={user.nationalCode} />
        </Box>
        <Box sx={{ ...flexRowStyle, gap: '1rem' }}>
          <Section title='نام پدر' value={test} />
          <Section title='تاریخ تولد' value={test} />
          <Section title='محل صدور شناسنامه' value={test} />
          <Section title='تلفن همراه' value={user.cellPhoneNumber} />
        </Box>
        <Section title='نشانی' value={test} />
        <Box sx={{ ...flexRowStyle, gap: '1rem' }}>
          <Section title='کد پستی' value={test} />
          <Section title='تلفن ثابت' value={test} />
          <Section title=' کد سجام' value={test} />
          <Section title=' کد بورسی' value={test} />
        </Box>
        <Typography>
          و سبدگردان با مشخصات:
        </Typography>
        <Box sx={{ ...flexRowStyle, gap: '1rem' }}>
          <Section title='نام' value={test} />
          <Section title='شماره ثبت' value={test} />
          <Section title='تاریخ ثبت ' value={test} />
          <Section title='محل ثبت' value={test} />
          <Section title=' تلفن' value={test} />
          <Section title='مابر' value={test} />
        </Box>
        <Section title='نشانی' value={sabadGardanAddress} />
        <Section title='به نمایندگی' value={namayandegi} />
      </Typography>

      <Typography>ماده ۲ : تعاریف : اصطلاحات به کار رفته در این قرارداد دارای معانی زیر هستند:</Typography>
      <Box>
        {definitions.map((d, index) => <Typography>
          <Section title={`${index + 1} - ${d.title}`} value={d.description} />
        </Typography>)}
      </Box>
      <Typography>
        {`ماده ۳ : موضوع قرارداد :    موضوع قرارداد عبارتست از سبدگردانی ${accountType} (موضوع ماده 4 ) : توسط سبدگردان با رعایت اهداف، اصول و محدودیتهای لازم الرعایه پیوست شماره 2 این قرارداد.`}
      </Typography>
      <Typography>ماده 4 :مدت قرارداد و تاریخ اجرایی شدن آن :  این قرارداد از تاریخی که به موجب ماده 5 اجرایی میشود، منعقد شده و تا تاریخ  اعتبار دارد.</Typography>
      <Typography>ماده 5 :این قرارداد از زمانی اجرایی میشود که: </Typography>
      <Typography><b>الف -</b> وجوه نقد موضوع ماده 6 به حساب بانکی مربوطه واریز شود .</Typography>
      <Typography><b>ب -</b>در صورتیکـه اجـرای موضـوع قـرارداد منـوط بـه تسـلیم اوراق بهـادار موضوع ماده 6 به سـبدگردان باشـد، اوراق بهادار یاد شـده به سـبدگردان تسـلیم شـده باشـد.درصورتیکه بخشـی از وجوه نقد واریز یا بخشـی از اوراق بهـاداری کـه بایـد تسـلیم شـوند، تسـلیم شـده باشـد و سـبدگردان ظـرف 7 روز کاری از تاریـخ واریـز وجـوه نقـد یا تسـلیم اوراق بهادار یاد شـده، عدم موافقت بـا اجرای موضوع قـرارداد را برای همـان بخش از وجـوه یـا اوراق بهـادار بـه سـرمایه گذار اطلاع ندهـد، قـرارداد بایـد در مورد آن بخش از وجوه یا اوراق بهادار که تسـلیم شـده اسـت، اجرا شـود.</Typography>
      <Typography>
        ماده 6 :مبلغ سبد اختصاصی :
      </Typography>
      <Typography>
        {`سـرمایه گذار پس از انعقاد قرارداد جمعاً ${totalPrice} ریال از دارایی خود را شامل اوراق بهادار به شرح پیوست شماره 1 این قـرارداد که به ارزش ${totalPrice} ریال تقویم شـده اسـت و ${totalPrice} ریال وجـه نقـد بـه منظـور سـبدگردانی در اختیـار سـبدگردان می‌گذارد. `}
      </Typography>
      <Typography>
        هرگونه برداشـت و پرداخت وجه نقد یا اوراق بهادار توسـط سرمایه گذار که مربوط بـه این قرارداد باشـد در تاریـخ برداشـت یـا پرداخـت، از مجمـوع مبالـغ و اوراق بهـادار ذکـر شـده در این ماده که در اختیار سـبدگردان گذاشـته شـده یا می‌شـود، به ترتیب کسـر یا بـه آن اضافه می‌گردد تا سـبداختصاصی سرمایه گذار در آن تاریخ، معین شـود.
      </Typography>
      <Typography>
        <b>تبصره 1 :</b>
        وجه نقد موضوع این ماده باید به حساب بانکی مخصوصی واریز گردد که سبدگردان مطابق دستورالعمل تأسیس و فعالیت سبدگردان افتتاح کرده و به سرمایه‌گذار اعلام نموده است.
      </Typography>
      <Typography>
        <b>تبصـره 2 :</b>
        سرمایه گذار اذعـان می‌کنـد کـه اوراق بهـادار موضـوع پیوسـت 1 ،‌ بـه وی تعلـق دارد و تصـرف وی در آن اوراق بهـادار بـه هیـچ وجـه محـدود، مقیـد یـا ممنـوع نمی‌باشـد.درصورتیکه خلاف این امر ثابت شـود، مسـئولیتی متوجـه سـبدگردان نخواهـد بـود.هـرگاه سـبدگردان از ایـن امـر مطلـع شـود کـه تمـام یـا بخشـی از اوراق بهـادار موضوع پیوسـت 1 ،به سرمایه گذار تعلق نـدارد یا تصـرف وی در تمام یا بخشـی از ایـن اوراق بهـادار مقیـد، محـدود یـا ممنـوع اسـت، یـا هـرگاه سـبدگردان آگاهـی یابد کـه نمی‌تواند موضـوع قـرارداد را در خصوص تمام یا قسـمتی از سـبداختصاصی اجـرا کند، باید موضـوع را بلافاصله بـه سرمایه گذار اطلاع دهد.
      </Typography>
      <Typography>
        <b>تبصـره 3 :</b>
        سـبدگردان موظـف اسـت هنـگام دریافـت اوراق بهـادار، رسـید دریافـت اوراق بهـادار را در فـرم مشـابه پیوسـت 1 این قـرارداد تنظیم و به سرمایه گذار ارائـه دهد.در صورتیکـه تعداد اوراق بهـادار از یک نوع که به سـبدگردان تسـلیم میشـود، بیشـتر از تعداد اوراق بهادار مذکور در پیوسـت 1 باشـد، آنگاه سـبدگردان موظف اسـت پس از انتقال تعداد لازم از اوراق بهادار به کد سـبدگردانی اختصاصی، گواهی مربوط بـه تعـداد باقیمانـده را از مرجـع مربوطـه اخذ و ظـرف یک هفته به سرمایه گذار تسـلیم کند.
      </Typography>
      <Typography>
        ماده 7 :کارمزد سبدگردان و هزینه‌های سبد :     کارمزد روزانه‌ی خدمات سبدگردان برابر مجموع موارد زیر است:
      </Typography>
      <Typography fontWeight={'bold'}>
        الف- کارمزد ثابت روزانه خدمات سبدگردان:
      </Typography>
      <Typography>
        1.98 درصد از ارزش روز سهام و حق تقدم سبد اختصاصی سرمایه گذار پس از کسر بدهی‌های مربوط به سبد اختصاصی به قیمت‌های پایانی همان روز تقسـیم بر 365.
        <br />
        1.98 درصد سود سپرده‌های سرمایه‌گذاری و گواهی‌های سپرده بانکی در پایان آن روز تقسیم بر 365 .
        <br />
        1.98 درصد از ارزش سایر اوراق بهادار سبد اختصاصی پس از کسر بدهی‌های مربوط به خرید اوراق بهادار مذکور به قیمت های پایانی همان روز تقسیم بر 365.
      </Typography>
      <Typography>
        <b> ب-کارمزد متغیر:</b>
        درصورتی که خالص بازدهی به دست آمده برای سرمایه گذار دریک سال پس از کسرکارمزد بند فوق بیش از <b>15</b> درصدباشد، سبدگردان علاوه برکارمزد ثابت <b>19.89</b> درصد از خالص بازدهی ایجاد شده را به عنوان  کارمزد متغیر سبدگردان محاسبه و دریافت می‌نماید مشروط بر اینکه خالص بازدهی به دست آمده برای سرمایه گذار پس از کسر کارمزدهای موضـوع بندهای الـف و ب از  سالیانه <b>15</b>درصد کمتر نشود.
      </Typography>
      <Typography>
        <b>تبصـره 1 : </b>
        سبدگردان میزان کارمزد ثابت را به صورت ماهانه از طریق پورتال به اطلاع مشتریان رسانده و این مبلغ را از محل وجوه نقد و یا اوراق بهادار سرمایه گذار نزد سبدگردان برداشت می‌نماید. سبدگردان هرسه ماه یکبار، صورتحساب کارمزد متغیر را طبق این ماده تهیه نموده و به اطلاع می‌رساند.سبدگردان حداکثر بعد از 7 روزکاری از زمان اطلاع رسانی مجاز خواهد بود تا کارمزد خود را ازمحل وجوه نقد یا اوراق بهادار نزد سبدگردان برداشت کند. مشروط به اینکه:
      </Typography>
      <Typography>
        ۱- بلافاصله رسید برداشت کارمزد را به اطلاع مشتری برساند.  ۲- مشتری کارمزد را به حساب سبدگردان واریز نکرده باشد.
      </Typography>
      <Typography>
        <b>تبصـره 2 : </b>
        کارمـزد متغیـر محاسـبه شـده سـه ماهـه بـه صـورت علی‌الحسـاب بـوده و در انتهـای سـال، کارمـزد متغیـر براسـاس عملکـرد سالانه بـه صـورت قطعی محاسـبه می‌گـردد و اگر کارمـزد مازادی اخذ شـده باشـد به سرمایه گذار پرداخـت میشـود و برعکـس اگـر کارمـزد کمتـری دریافـت شـده باشـد مابقـی آن از سرمایه گذار اخذ میشـود.
      </Typography>
      <Typography>
        <b>تبصـره 3 : </b>
        اگر مدت توافقی قرارداد کمتر از یکسال باشد یا سرمایه گذار اقدام به برداشت تمام یا بخشی از سرمایه خود قبل از اتمام موعد سالانه قرارداد نماید، بازدهی سالانه شـده سبد اختصاصی در همان دوره با نرخ بازده سالانه ذکر شده در بند 4 این ماده مقایسه کرده و کارمزد متغیر سبدگردان به طور قطعی محاسبه و دریافت میگردد.
      </Typography>
      <Typography>
        <b>تبصره 4:</b>
        بازدهی کمتر از یک سال از طریق فرمول زیر سالانه میشود:
      </Typography>
      <Typography>
        که در آن پارامترها به این گونه تعریف می شوند:
      </Typography>
      <Box sx={{ ...flexRowStyle, gap: '2rem' }}>
        <Typography>  R_T  بازدهی سالانه شده،</Typography>
        <Typography>  R_t بازدهی دوره t کمتر از یکسال،</Typography>
        <Typography>T :کل دوره t به روز</Typography>
      </Box>
      <Typography>
        ماده ۸ : هزینه‌های اجرای موضوع قرارداد که به عهده سرمایه‌گذار است، منحصراً شامل:
      </Typography>
      <Typography>
        <b>  الف -</b> کارمزد سبدگردان مطابق ماده (7)؛
        <br />
        <b> ب - </b>
        کارمزد انجام معامالت داراییهای سبد اختصاصی که مطابق مقررات مربوطه تعیین و پرداخت میشود؛
        <br />
        <b>ج -</b>
        مالیات فروش و نقل و انتقال دارایی‌های سبد اختصاصی که در اجرای موضوع قرارداد الزم باشد؛
        <br />
        <b>د - </b>
        کارمزد سبدگردان برای فروش داراییها پس از خاتمه قرارداد، درصورتیکه پس از خاتمه قرارداد دارایی‌ها طبق تبصره ماده 26 توسط سبدگردان به فروش رود.
      </Typography>
      <Typography>
        <b>تبصره 1 : </b>
        به جز هزینه های مذکور در این ماده، سایر هزینه‌های مربوط به اجرای موضوع قرارداد به عهده‌ی سبدگردان می‌باشد و سرمایه‌گذار تعهد و مسئولیتی در پرداخت آن هزینه‌ها ندارد.
      </Typography>
      <Typography>
        <b>تبصره 2 : </b>
        هزینه‌های موضوع بندهای (ب)، (ج) و (د) این ماده مستقیماً از محل سبد اختصاصی پرداخت میشود و در مورد پرداخت هزینه‌های موضوع بند (الف) این ماده، بر اساس تبصره ماده 7 عمل میشود.
      </Typography>
      <Typography>
        ماده ۹ : اهداف، اصول و محدودیتهای لازم الرعایه : سبدگردان باید اهداف، اصول و محدودیت‌های لازم الرعایه را که سرمایه گذار مطابق پیوست شماره (2) این قرارداد تعیین کرده است، در اجرای موضوع قرارداد مراعات کند.هرگونه تغییر در اهداف، اصول و محدودیت‌های الزمالرعایه مهلتی کـه بـه سبدگردان بـرای اعمال این تغییرات داده میشود، باید طی متمم قرارداد بـه تائید طرفین قرارداد برسد.
      </Typography>
      <Typography>
        ماده ۱۰ : گزارش دهی : سـبدگردان موظـف اسـت بازدهـی سـبد اختصاصـی را در دوره‌هـای زمانـی، روزانـه، هفتگـی، ماهانـه و سالانه و بازدهـی سالانه شـده هرکـدام از دورههایـی که کمتر از یک سـال اسـت را مطابق دسـتورالعمل تأسیس و فعالیـت سـبدگردان، محاسـبه و حداکثـر تـا ۱۰ روز کاری بعـد از پایـان هـر دوره از طریـق سـایت اینترنتـی خـود صرفـاً در اختیـار سرمایه گذار قراردهـد. سـبدگردان همچنین بایـد گزارش عملکـرد خود در خصـوص موضوع ایـن قـرارداد را در دوره هـای سـه ماهـه حداکثـر 10 روز کاری پـس از پایـان هـر دوره و همچنیـن بـرای آخریـن دوره حداکثـر 10 روز کاری پـس از خاتمه قرارداد، تهیه کرده و همزمان به سرمایه گذار و سـازمان ارسـال یـا ارائـه کنـد.این گـزارش شـامل اطلاعات زیر اسـت:
      </Typography>
      <Typography>
        <b> الف -</b>
        دوره گزارش، تاریخ تهیه، مشخصات سرمایه‌گذار، شماره و تاریخ قرارداد و مشخصات سبدگردان.
        <b>  ب -</b>
        صورتهای مالی برای سرمایه‌گذار بعنوان یک واحد مستقل حسابداری طبق اصول و رویه‌های حسابداری شامل ترازنامه، صورتحساب سود و زیان و صورت گردش وجوه نقد به همراه یادداشت‌های همراه.
        <b> ج – </b>
        خالصه‌ی عملکرد سبدگردان و دارایی‌های سرمایه‌گذار که به تفکیک هر دارایی به شرح زیر تهیه شده و در یادداشت‌های همراه صورتهای مالی موضوع بند
        (ب) فوق، افشا میشود:
      </Typography>
      <Box>
        <Typography>
          <b>{`1 - `}</b>
          شرح، تعداد، قیمت تمام شده و ارزش روز دارایی درابتدای دوره گزارش،
        </Typography>
        <Typography>
          <b>{`2 - `}</b>
          تعداد وقیمت تمام شده دارایی خریداری شده طی دوره گزارش،
        </Typography>
        <Typography>
          <b>{`3 - `}</b>
          تعداد، قیمت تمام شده و قیمت فروش دارایی فروخته شده طی دوره گزارش،
        </Typography>
        <Typography>
          <b>{`4 - `}</b>
          تعداد، قیمت تمام شده و ارزش روز دارایی درانتهای دوره گزارش،
        </Typography>
        <Typography>
          <b>{`5 - `}</b>
          ارزش مزایای تعلق گرفته به داراییها و سرمایهگذار طی دوره گزارش،
        </Typography>
        <Typography>
          <b>{`6 - `}</b>
          سود یا زیان حاصله طی دوره برای هردارایی.
        </Typography>
      </Box>
      <Typography>
        <b>د- </b>
        جزئیات اطلاات معاملات انجام شـده به نام سرمایه گذار طی دوره گزارش به تفکیک هر دارایی معامله شده شامل تاریخ انجام معامله، تعدادو قیمت خرید دارایی خریداری شده، تعداد و قیمت فروش دارایی فروخته شده که دریادداشتهای همراه صورتهای مالی موضوع بند(ب) فوق افشا میشود. ی-جزئیات مزایای تعلق گرفته به دارایی‌های سرمایه گذارطی دوره گزارش ازقبیل سود، بهره، سودسهمی وحق‌تقدم خرید بهمراه تاریخ تعلق هریک در یادداشت‌های همراه صورتهای مالی موضوع بند(ب) فوق افشا میشود.
      </Typography>
      <Typography>
        <b>تبصره :</b>
        منظور ازارزش روز دراین ماده، ارزش دارایی براساس قیمت پایانی درتاریخ پایان دوره گزارش است
      </Typography>
      <Typography>
        ماده ۱۱ : سبدگردان درطول مدت قرارداد،حداکثر10روزکاری پس ازپایان هرماه، موظف است مستندات مربوط به معاملات اوراق بهادار راکه دررابطه با این قرارداد درآن ماه انجام شده، به سرمایه‌گذارتسلیم کند.
      </Typography>
      <Typography>
        ماده ۱۲ : درصورت درخواست سرمایه‌گذار برای ارائه گزارش خاص و فوق‌العاده، سبدگردان موظف است در مقابل دریافت هزینه مورد توافق طرفین، ظرف مدت 5 روزکاری گزارش مزبور رادر اختیاروی قراردهد.
      </Typography>
      <Typography>
        ماده ۱۳ : نرم افزار سبدگردانی : سبدگردان موظف است نرم‌افزار ویژه‌ای که برای عملیات سبدگردانی به تأیید سازمان رسیده است، بـه منظور اجرای این قرارداد تهیه کند و اطلاعات مربوط به کلیه دارایی‌ها و بدهی‌های سرمایه‌گذار که در رابطه با این قرارداد می‌باشند را در هر روز در آن ثبت و نگهداری کند. این نرم‌افزار باید بتواند گزارش‌های موضوع ماده (10 )را در هر تاریخ دلخواه تهیه کند.
      </Typography>
      <Typography>
        ماده ۱۴ : مجاری ارتباطی سبدگردان با سرمایه گذار : سـبدگردان می‌توانـد از هریـک از مجـاری زیـر بـرای ارسـال گزارش‌هـای عملکـرد یـا مطلـع سـاختن سرمایه گذار از آنچـه طبـق ایـن قـرارداد، سـبدگردان باید برای سرمایه گذار ارسـال یـا به اطلاع وی برسـاند، اسـتفاده کند :   ۱- پست سفارشی به نشانی مذکور در ماده (1)و در صورت تغییر، به نشانی جدیدی که سرمایه‌گذار کتباً به سبدگردان معرفی نماید. ۲- ارسال رایانامه(email) به نشانی الکترونیکی ذکر شده در ماده 1 و در صورت تغییر، به نشانی الکترونیکی جدیدی که سرمایه‌گذار کتباً به سبدگردان معرفی کند.   ۳- ارسال پیامک (SMS) به شماره تلفن ذکر شده در ماده 1 و در صورت تغییر، به شماره تلفن جدیدی که سرمایه‌گذار کتباً به سبدگردان معرفی نماید.
      </Typography>
      <Typography>
        <b>تبصـره 1 :</b>
        اطلاعـات و گزارش‌هـای مخصـوص سرمایه گذار علاوه بـر ارسـال از یکـی از طـرق مذکـور در ایـن مـاده، از طریق سـایت اینترنتی سـبدگردان بـه نشـانی www.hadafwm.ir  نیز با اسـتفاده از کلمـه و رمز عبور مخصـوص سرمایه‌گذار در دسـترس سرمایه گذار قرار خواهد داشـت.
        <br />
        <b>تبصـره 2 :</b>
        در مـواردی کـه در قـرارداد تسـلیم مـدارک، مسـتندات و گزارشهـا از یـک طـرف بـه طـرف دیگـر پیش‌بینی شده‌اسـت، لازم اسـت مدارک، مسـتندات و گزارشهـای مورد نظر به شـخص طرف مقابـل یا وکیل، ولـی، قیـم یـا نماینـده قانونـی وی داده شـده و رسـید دریافـت گـردد یـا مـدارک، مسـتندات و گزارش‌هـا از طریـق پسـت سفارشـی به نشـانی طـرف دیگر کـه در ماده 1 آمـده و در صـورت تغییر به نشـانی جدیـدی که وی کتبـاً اعلام نموده، ارسـال شـود.
      </Typography>
      <Typography>
        ماده ۱۵ : حقوق و مزایای متعلق به اوراق بهادار : سود سهام، سود اوراق مشاركت، سهام جایزه، سود ساير اوراق بهادار، برگه‌های حق تقدم و بطورکلی کلیه‌ی منافع و مزایای دارایی‌های سبد اختصاصی بـه سرمایه گذار تعلق دارد و جزو سبد اختصاصی وی محسوب شده و موضوع قرارداد در مورد آنها اجرا میشود. سبدگردان در طول مدت قرارداد و در صورت تمدید تا پایان مهلت تمدید شده، از جانب سرمایه گذار وکالت و وظیفه دارد که این منافع و مزایا را دریافت کند و به سبداختصاصی اضافه نماید.سبدگردان همچنین در اعمال کلیه‌ی حقوق ناشی از اوراق بهادار سبد اختصاصی اعم از حق حضور در مجامع، حق رأی، حق تقدم در خرید سایر اوراق بهادار و حق تبدیل اوراق بهادار به اوراق بهادار دیگر، وکیل سرمایه گذار تلقی میشود و در چگونگی اعمال این حقوق باید مصالح سرمایه گذار را در نظر گیرد.
      </Typography>
      <Typography>
        <b>تبصـره  :</b>
        در صـورت اتمـام مهلـت قـرارداد و عـدم تمدیـد آن و همچنیـن در صـورت فسـخ یـا انفسـاخ قـرارداد، سـبدگردان موظـف اسـت ظـرف هفـت روز کاری موضـوع را به شـرکت‌هایی که ناشـر اوراق بهـادار موجود در سـبداختصاصی محسـوب میشـوند و سـایر اشـخاص مرتبـط اعلام کنـد و از آنهـا بخواهـد کـه از آن پـس حقـوق و مزایـای متعلـق بـه اوراق بهـادار را مسـتقیماً بـه سرمایه گذار پرداخـت نماینـد و مکاتبـات، برگه‌هـای حق تقـدم و سـهام جایـزه و مـوارد مشـابه را بـه نشـانی سرمایه گذار ارسـال دارنـد.  نشـانی و تلفن‌هـای تمـاس سرمایه گذار نیـز مطابـق مـاده (1)و درصـورت تغییر، مطابق با نشـانی و شـماره تلفن‌هایـی که سرمایه‌گذار کتباً اعلام نمـوده، توسـط سـبدگردان بـه ناشـرین اوراق بهادار اعلام می‌شـود.
      </Typography>
      <Typography>
        ماده ۱۶ : رازداری : طرفیـن قـرارداد بایـد کلیـه اطلاعاتـی را کـه در رابطـه بـا ایـن قـرارداد در اختیـار دارنـد محرمانـه تلقی کننـد و به جز به سـازمان، بازرس قانونی یا حسـابرس سـبدگردان، امین سـبدگردان، کانـون مربوطه یـا مراجع صالح قضایـی، بـدون رضایـت کتبـی طـرف مقابـل به شـخص دیگری ارائـه نکنند، یا بـرای عموم افشـا ننمایند.
      </Typography>
      <Typography>
        ماده ۱۷ : رعایت قوانین و مقررات : سـبدگردان بایـد در اجـرای موضـوع قـرارداد، قوانیـن و مقـررات از جملـه قانـون بـازار اوراق بهـادار و مقرراتـی کـه براسـاس قانـون یادشـده توسـط مراجـع ذیصلاح تصویب شـده یا می‌شـوند بـه خصوص دسـتورالعمل تأسیس و فعالیـت سـبدگردان را رعایـت نمایـد.در صـورت تضـاد بیـن ایـن قـرارداد و قوانیـن و مقررات مذکور، سـبدگردان موظف بـه رعایت قوانین و مقررات می‌باشـد و در این‌صـورت بابت عدم رعایـت این قرارداد، مسـئولیتی متوجه سـبدگردان نیست.
      </Typography>
      <Typography>
        ماده ۱۸ : وجوه بلااستفاده : سـبدگردان بایـد حداکثـر تلاش خـود را بنمایـد تـا وجـوه نقـد سـبد اختصاصـی را بلافاصلـه در اجـرای موضـوع قـرارداد بـه کار گیرد.در هـر زمان کـه وجوه نقد سـبد اختصاصی بیـش از ده درصـد ارزش سـبد اختصاصی شـود و سـبدگردان نتوانـد ظـرف 7 روز کاری از آن زمـان، تمـام یـا قسـمتی از ایـن وجـوه را در اجـرای موضـوع قـرارداد بـه‌کار گیـرد یـا بـه نظـر وی این امر بـه صالح سرمایه‌گذار نباشـد، باید:
        الف- بلافاصله وجوه مذکور را به حسابهای بانکی مشمول سود واریز کند وسرمایه‌گذار را از این امر مطلع نماید.    ب – سرمایه‌گذار را از این امر مطلع نماید.
        تبصره: وجوه متعلق به سرمایه‌گذار همواره در حساب یا حسابهای بانکی مخصوصی که مطابق دستورالعمل تأسیس و فعالیت سبدگردان افتتاح شده یا می‌شود واریز و نگهداری می‌شود.
      </Typography>
      <Typography>
        ماده ۱۹ : برداشت و واریز سرمایه‌گذار :  سرمایه‌گذار می‌توانـد در طـول مـدت قـرارداد مبلغـی از دارایی‌هـای سـبد اختصاصـی را مطالبـه کنـد.در ایـن صـورت سـبدگردان بایـد ایـن مبلـغ را ظـرف 2 روز کاری پـس از درخواسـت سرمایه گذار از محـل وجوه نقد سـبد اختصاصـی بـه وی پرداخـت کنـد.درصورتیکـه وجـوه نقـد سـبد اختصاصـی بـرای پرداخـت کل مبلـغ مطالبه شـده کفایت نکند، سـبدگردان باید بلافاصلـه متناسـباً اقدام به فـروش میـزان لازم از دارایی‌های سـبد اختصاصی کرده و مابقـی را ظـرف 5 روز کاری پـس از فروش دارایی‌های مذکور به سرمایه گذار پرداخت کند.
      </Typography>
      <Typography>
        <b>تبصـره  :</b>
        درصورتیکـه به‌رغـم تلاش کافـی سـبدگردان بـرای فـروش دارایـی سرمایه گذار بـه منظـور تأمیـن وجـوه مـورد درخواسـت وی، امـکان فـروش بـه دلایلـی از جملـه عـدم وجود خریـدار میسـر نگردد، مسـؤولیتی متوجـه سـبدگردان نخواهـد بود.
      </Typography>
      <Typography>ماده ۲۰ :  سرمایه‌گذار میتواند در طول مدت قرارداد و با تنظیم متمم قرارداد، مبالغ یا اوراق بهادار دیگری را به سبدگردان پرداخت نماید و سبدگردان موظف است موضوع قرارداد را در قبال آنها نیز اجرا نماید.</Typography>
      <Typography>ماده ۲۱ : معرفی قرارداد به امین :  سـبدگردان موظـف اسـت ظـرف هفـت روز کاری پـس از اجرایـی شـدن قـرارداد، مشـخصات و نسـخ‌های از قرارداد را برای امین ارسـال و درصورتیکه مطابق دسـتورالعمل تأسیس و فعالیت سـبدگردان یا سـایر مقررات مربوطـه، معرفـی ایـن قـرارداد بـه امیـن و پذیـرش سـمت امیـن در مـورد آن ضـروری باشـد، تشـریفات لازم را بـه ایـن منظـور بـه انجـام رسـاند. در صورتیکـه به هـر دلیـل، امین طرف قـرارداد بـا سـبدگردان در اجرای وظایـف و مسـئولیت‌های خـود طبـق دسـتورالعمل تأسیس و فعالیـت سـبدگردان، قصـور نمایـد و از ایـن بابـت خسـارتی بـه سرمایه گذار وارد شـود، سـبدگردان بـه موجـب این قـرارداد، جبران خسـارت مذکور را توسـط امیـن تضمین نموده اسـت.</Typography>
      <Typography>ماده ۲۲ : تخلفات و اختلافات :  مرجع رسیدگی به اختلافات بین سرمایه‌گذار و سبدگردان براساس قانون بازار اوراق بهادار در صورت عدم سازش در کانونهای موضوع ماده 36 این قانون، هیأت داوری مذکور در ماده 37 این قانون است.</Typography>
      <Typography>
        <b>تبصـره  :</b>
        براساس تبصره ماده 33 قانون بازار اوراق بهادار، تا تشکیل کانون مربوطه وظایف این کانون را در رابطه با این ماده، سازمان انجام میدهد.
      </Typography>
      <Typography>ماده ۲۳ :  به تخلفات سبدگردان از این قرارداد یا مقررات مذکور در ماده 17 طبق قانون بازار اوراق بهادار و آیین‌نامه‌ها و دستورالعملهای اجرایی آن قانون رسیدگی میشود.</Typography>
      <Typography>ماده ۲۴ : فسخ ، انفساخ و تمدید قرارداد : هریـک از طرفیـن قـرارداد میتوانـد قـرارداد را قبـل از انقضـای مـدت، فسـخ کنـد، مشـروط بـه اینکه این موضـوع را کتباً به طـرف دیگر اطلاع دهد.در صورتیکه مجوز فعالیت سـبدگردانی سـبدگردان از سـوی سـازمان لغـو شـود یـا بیـش از یـک مـاه تعلیـق شـود، ایـن قـرارداد بلافاصلـه از زمـان ابلاغ رسـمی ایـن تصمیم منفسـخ میشـود.همچنیـن از زمانیکه سـبدگردان به حکـم مراجع ذیصلاح ورشکسـته اعلام شـود یا خود بـه دادگاه تقاضـای ورشکسـتگی ارائـه دهد، این قرارداد منفسـخ میشـود.</Typography>
      <Typography>ماده ۲۵ : تمديد این قرارداد از طریق تنظیم متمم قرارداد امکانپذیر است.</Typography>
      <Typography>ماده ۲۶ : اقدامات پس از خاتمه قرارداد : پـس از پایـان مهلـت قـرارداد و عـدم تمدیـد آن و همچنیـن در صـورت فسـخ یـا انفسـاخ آن، قـرارداد خاتمـه یافته تلقی میشـود و سـبدگردان مجاز نیسـت در ترکیب دارایی‌های سرمایه گذار کـه مربوط به ایـن قرارداد اسـت، تغییـری ایجـاد کنـد و موظـف اسـت موضـوع را بلافاصله بـه اطلاع سرمایه گذار برسـاند. سـبدگردان بایـد کل وجـوه نقـد متعلـق بـه سرمایه گذار در رابطـه بـا ایـن قـرارداد را ظـرف 2 روز کاری بـه سرمایه گذار پرداخـت کنـد و درصورتیکـه سرمایه گذار مطابـق تبصـره ایـن مـاده فـروش سـایر دارایی‌های سـبد اختصاصی را از سـبدگردان درخواسـت ننموده باشـد، سبدگردان باید جهت انتقال سـایر دارایی‌های سبداختصاصی از جمله اوراق بهادار مربوطه بـه نام سرمایه گذار و دریافت و تسلیم گواهینامه‌های مربوطه ظرف حداکثر 10 روز کاری اقدام نماید.</Typography>
      <Typography><b>تبصـره  :</b>
        درصـورت درخواسـت سرمایه‌گذار قبـل از اینکـه پـس از خاتمـه قـرارداد، دارایی‌هـای سـبد اختصاصـی (به اسـتثنای وجوه نقـد) به نام سرمایه‌گذار منتقل شـود، سرمایه‌گذار میتوانـد از سـبدگردان بخواهد کـه فـروش داراییهـای سـبد اختصاصـی را بـه عهـده بگیـرد.در ایـن صـورت سـبدگردان موظـف اسـت تلاش کافـی بـرای فـروش ایـن دارایی‌هـا ظرف مهلتـی کـه سرمایه گذار تعیین میکنـد با رعایـت صرفـه و صالح وی بنمایـد.کارمـزد سـبدگردان بـرای ایـن امـر 0.2 درصد از مبلـغ فروش دارایی‌ها اسـت.
      </Typography>
      <Typography>
        ماده ۲۷ : ضمانت اجرا و بروز حوادث قهری :  درصورت نقض مفاد این قرارداد به این صورت  اقدام خواهد شد:
      </Typography>
      <Typography>
        <b>الف - </b>
        در صـورت عـدم رعايـت مهلت‌هـای مقـرر از طـرف سـبدگردان در تبصره‌هـای 2 و 3 مـاده‌ی 6 و عـدم رعایـت مهلت‌هـای مقـرر در مـواد 10 ،11 ،12 ،تبصـره‌ی مـاده‌ی 15 ،مـواد 18 ،19 ،21 و 26 ،سـبدگردان بایـد بـه ازاي هـر روز تأخيـر، 10.000 ريـال خسـارت تأخيـر يـا عـدم اجرای تعهـد به سـرمايه‌گذار پرداخـت نمايد.
      </Typography>
      <Typography>
        <b>ب - </b>
        در صـورت نقـض مـاده‌ی 16 قـرارداد توسـط هـر یـک از طرفیـن، طـرف نقض‌کننـده باید مبلـغ  10.000 ريال خسـارت به طرف دیگـر، پرداخت نمايـد. پرداخت این خسـارت مانع از اعمـال مجازات‌های مقـرر در قوانین و مقررات نخواهد شـد.
      </Typography>
      <Typography>
        <b>ج - </b>
        در صورتیکـه در اثـر عـدم رعایـت قوانیـن و مقـررات موضـوع مـاده‌ی 17 یـا عـدم رعایت مفاد قرارداد توسـط سـبدگردان، خسـاراتی متوجه سرمایه‌گذار گردد، سـبدگردان مسـئول جبـران این خسـارات خواهد بود. پرداخـت ایـن خسـارت مانـع از اعمـال مجازاتهـای مقرر در قوانیـن و مقررات نخواهد شـد.
      </Typography>
      <Typography>
        ماده ۲۸ :  درصورت بروز حوادث قهری مسئوليتی متوجه سبدگردان نخواهد بود.
      </Typography>
      <Typography>ماده ۲۹ : سایر موارد : درصورتیکه نشانی هر یک از طرفین قرارداد که در ماده (۱) ذکر شده تغییر یابد، وی موظف است نشانی جدید خود را کتباً به طرف مقابل اطلاع دهد.</Typography>
      <Typography>ماده ۳۰  : سـبدگردان موظـف اسـت کلیـه‌ی وجوهـی را کـه طبـق ایـن قـرارداد بایـد بـه سرمایه‌گذار پرداخـت کند از طریـق واریز به حسـاب بانکی به شـرح زیـر و در صورت معرفی حسـاب بانکـی جایگزین طبـق تبصره این مـاده، از طریـق واریـز به حسـاب بانکـی جایگزین، انجـام دهد.</Typography>
      <Section title={'نام بانک و شعبه'} value={''}></Section>
      <Section title={'ذینفع حساب '} value={''}></Section>
      <Section title={'شماره حساب '} value={''}></Section>
      <Section title={'شبای حساب'} value={''}></Section>
      <Typography><b>تبصـره  :</b>
        سرمایه گذار میتوانـد حسـاب بانکـی دیگـری را کـه به‌نـام خـود در یکـی از بانک‌هـای دارای مجـوز از بانـک مرکـزی جمهـوری اسلامی ایـران، افتتاح نموده اسـت، به‌عنـوان جایگزین حسـاب بانکی موضـوع این ماده معرفـی کند.
      </Typography>
      <Typography>
        {`ماده ۳۱ : اين قرارداد در 31 ماده و 15 تبصره و2 پيــوست درچـــهار نسخــه واحـــدالاعــتبار درتــــاريخ  ${'99/09/12'}`}
        {` بين طرفين قرارداد منعقد شد و دونسخه به سبدگردان، یک نسخه به سرمایه‌گذار تحویل گردید.`}
        {' سبدگردان بايد ظرف 7روزكاري يك نسخه از قرارداد رابه سازمان بورس اوراق بهادار ارسال ونزد اين سازمان ثبت نمايد. تبصره: نسخ متمم‌های اين قرارداد به تعداد نسخ قرارداد تنظيم ومشابه آن توزيع می شوند.'}
      </Typography>
      <br />
      <Typography>
        پیوست 1: دارایی های موضوع ماده ۶ قرارداد سبدگردانی
      </Typography>
      <Typography>
        داراییهای موضوع قرارداد:
      </Typography>
      <Typography>
        <b>الف : وجه نقد</b>
        <br />
        <Section title='مبلغ به عدد' value={`${'  '} ریال`}></Section>
        <Section title='مبلغ به حروف' value={`${'  '} ریال`}></Section>
        <Typography>
          {`به حساب شماره  ${'.... '} بانک ${'.... '} به نام  ${test} فیش ${'....'}  و به تاریخ ${'.....'} واریز گردید.`}
        </Typography>
      </Typography>
      <Typography>
        <b>ب : اوراق بهادار</b>
        <br />
        {
          [1, 2, 3].map((item, index) => {
            return <Box sx={{ ...flexRowStyle, gap: '2rem' }}>
              <Section title={`${index + 1} - نام دارایی`} value={test} />
              <Section title='تعداد ' value={test} />
              <Section title=' نرخ  تاریخ انتقال' value={test} />
              <Section title='مبلغ ' value={`${totalPrice} ریال`} />
            </Box>
          })
        }

        <Section title='جمع کل' value={`${totalPrice} ریال`} />
      </Typography>
      <br />
      <Typography>
        پیوست 2: اهداف، اصول و محدودیت‌های لازم الرعایه موضوع ماده ۳ قرارداد سبدگردانی
        اهداف ، اصول و محدودیت های الزم الرعایه قرارداد به شرح زیر می باشند:
        <Box>
          <Typography>
            <b>{`1 - `}</b>
            سرمایه‌گذاری در ترکیبی از اوراق بهادار متناسب با سطح ریسک‌‌ پذیری انتخاب شده در بند 2.
          </Typography>
          <Box sx={{ ...flexRowStyle, gap: '3rem' }}>
            <Typography>
              <b>{`2 - `}</b>
              سطح ریسک پذیری:
            </Typography>
            <Typography> خیلی کم</Typography>
            <Typography> کم</Typography>
            <Typography>متوسط</Typography>
            <Typography>زیاد</Typography>
            <Typography>خیلی زیاد</Typography>
          </Box>
          <Typography>
            <b>{`3 - `}</b>
            سبدگردان میتواندتا سقف 10 درصد ازخالص ارزش دارایی های سبد را با نرخ اعلامی وبه صورت اعتبار ازطرف کارگزاری بانرخ حداکثر سالیانه 25 درصد طبق مقررات مربوطه استفاده نماید.
          </Typography>
        </Box>
      </Typography>
    </Box>
  )
}

const Section = ({ title, value }: { title: string, value: any }) =>
  <Box sx={{ display: 'flex', flexDirection: 'row', gap: '1px', flexWrap: 'wrap', whiteSpace: 'pre-wrap' }}>
    <Typography component='div'><b>{title}</b>{` : ${value}`}</Typography>
  </Box>;



export default SejamAccountContractStep